; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_3 ?v1 - type_2 ?v5 - type_3)
 	      (pred_4 ?v3 - object ?v5 - type_3)
	      (pred_2 ?v1 - type_2 ?v7 - type_1)
	      (pred_1 ?v1 - type_2 ?v3 - object ?v7 - type_1))

   (:action op_1
       :parameters  (?v1 - type_2 ?v2 ?v8 - type_3)
       :precondition (and  (pred_3 ?v1 ?v2))
       :effect (and  (pred_3 ?v1 ?v8)
		     (not (pred_3 ?v1 ?v2))))

   (:action op_2
       :parameters (?v1 - type_2 ?v6 - object ?v4 - type_3 ?v7 - type_1)
       :precondition  (and  (pred_4 ?v6 ?v4) (pred_3 ?v1 ?v4) (pred_2 ?v1 ?v7))
       :effect (and (pred_1 ?v1 ?v6 ?v7)
		    (not (pred_4 ?v6 ?v4)) 
		    (not (pred_2 ?v1 ?v7))))

   (:action op_3
       :parameters (?v1 - type_2 ?v6 - object ?v4 - type_3 ?v7 - type_1)
       :precondition  (and  (pred_1 ?v1 ?v6 ?v7) (pred_3 ?v1 ?v4))
       :effect (and (pred_4 ?v6 ?v4)
		    (pred_2 ?v1 ?v7)
		    (not (pred_1 ?v1 ?v6 ?v7)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_05 obj_06 - type_2
obj_07 obj_11 obj_08 obj_01 - type_1
obj_10 obj_13 obj_04 obj_09 - type_3
obj_03 obj_02 obj_12 - object)
(:init
(pred_3 obj_05 obj_13)
(pred_2 obj_05 obj_07)
(pred_2 obj_05 obj_11)
(pred_3 obj_06 obj_09)
(pred_2 obj_06 obj_08)
(pred_2 obj_06 obj_01)
(pred_4 obj_03 obj_10)
(pred_4 obj_02 obj_13)
(pred_4 obj_12 obj_04)
)
(:goal
(and
(pred_4 obj_03 obj_10)
(pred_4 obj_02 obj_04)
(pred_4 obj_12 obj_10)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_05 obj_04) (pred_3 obj_06 obj_04))))
  )
)
)

; plan
1. (op_2 obj_05 obj_02 obj_13 obj_11)
   deleted: (pred_4 obj_02 obj_13) (pred_2 obj_05 obj_11)
   added: (pred_1 obj_05 obj_02 obj_11)
   goals met: 1 of 3
2. (op_1 obj_06 obj_09 obj_10)
   deleted: (pred_3 obj_06 obj_09)
   added: (pred_3 obj_06 obj_10)
   goals met: 1 of 3
3. (op_1 obj_05 obj_13 obj_04)
   deleted: (pred_3 obj_05 obj_13)
   added: (pred_3 obj_05 obj_04)
   goals met: 1 of 3
4. (op_3 obj_05 obj_02 obj_04 obj_11)
   deleted: (pred_1 obj_05 obj_02 obj_11)
   added: (pred_4 obj_02 obj_04) (pred_2 obj_05 obj_11)
   goals met: 2 of 3
5. (op_2 obj_05 obj_12 obj_04 obj_07)
   deleted: (pred_4 obj_12 obj_04) (pred_2 obj_05 obj_07)
   added: (pred_1 obj_05 obj_12 obj_07)
   goals met: 2 of 3
6. (op_1 obj_05 obj_04 obj_10)
   deleted: (pred_3 obj_05 obj_04)
   added: (pred_3 obj_05 obj_10)
   goals met: 2 of 3
7. (op_3 obj_05 obj_12 obj_10 obj_07)
   deleted: (pred_1 obj_05 obj_12 obj_07)
   added: (pred_4 obj_12 obj_10) (pred_2 obj_05 obj_07)
   goals met: 3 of 3
